Revit 2024 API
LightGroupManager Methods
The LightGroupManager type exposes the following members.
Methods
Name | Description
CreateGroup
 Create a new LightGroup object with the given name
DeleteGroup
 Remove the given LightGroup object from the set of LightGroup objects
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetGroups
 Get the set of contained LightGroup objects The set of LightGroup objects
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLightDimmer
 Gets the dimmer value for the given light for rendering the given view
GetLightGroupManager
 Creates a light group manager object from the given document
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsLightGroupOn
 Returns true if the given light group is on
IsLightOn
 Returns true if the given light is on for rendering the given view
SetLightDimmer
 Sets the dimmer value for the given light for rendering the given view
SetLightGroupOn
 Turns the given light group on or off for rendering the given view depending on the bool argument
SetLightOn
 Turns the given light on or off for rendering the given view depending on the bool argument
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace